Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: To include an actual quote character inside a quoted string, specify two consecutive quotes as shown twice in this example:
fr: Pour inclure de vrais caractères guillemet dans une chaîne entre guillemets, utiliser un double guillemet comme montré deux fois dans cet exemple :

source: To include the contents of the same file multiple times, use #IncludeAgain.
fr: Pour inclure le contenu d'un même fichier plusieurs fois, utiliser #IncludeAgain (inclure à nouveau).

source: To instead open the folder for all users, enter shell:common startup (however, in that case you must be an administrator to proceed).
fr: Pour ouvrir à la place le dossier pour tous les utilisateurs, entrer shell:common startup (toutefois, dans ce cas il faut être un administrateur pour continuer).

source: To learn how, read the tutorial or dive straight in.
fr: Pour apprendre comment faire, lire le tutoriel ou foncer directement.

source: To open a script for editing, right-click on the script file and select Edit Script.
fr: Pour ouvrir un script à des fins de modification, clic droit sur le fichier de script puis sélectionner Edit Script.

source: To override which version of AutoHotkey.exe is set as the default, pass one of the following switches:
fr: Pour définir manuellement la version utilisée par défaut de AutoHotkey.exe, utiliser l'un des deux commutateurs suivants :

source: To pause or resume the entire script at the press of a key, assign a hotkey to the Pause command as in this example:
fr: Pour mettre en pause ou reprendre l'exécution de tout le script à l'appui d'une touche, associer une hotkey à la commande Pause comme dans cet exemple :

source: To perform a double-deref in such cases, enclose the expression in parentheses:
fr: Pour effectuer une double référence dans ces cas-là, l'expression est à mettre entre parenthèses :

source: To read other UTF-8 files which lack a byte order mark, use FileEncoding UTF-8-RAW, the *P65001 option with FileRead, or "UTF-8-RAW" for the third parameter of FileOpen().
fr: Pour lire d'autres fichiers UTF-8 sans indicateur d'ordre des octets, utiliser FileEncoding UTF-8-RAW, l'option *P65001 avec FileRead, ou "UTF-8-RAW" comme troisième paramètre de FileOpen().

source: To remap some other key to become a "mystery key", follow this example:
fr: Pour reconfigurer une autre touche afin de devenir une "touche mystère", suivez cet exemple:

source: To remove keys and values:
fr: Pour enlever des clés et valeurs :

source: To remove such quotes, use StringReplace, 1, 1, ",, All.
fr: Pour enlever de tels guillemets, utiliser StringReplace, 1, 1, ",, All.

source: To resolve this, save the file as UTF-8 with BOM or add the /CP65001 command line switch.
fr: Pour résoudre le problème, sauvegarder le fichier en UTF-8 avec BOM ou ajouter le commutateur de ligne de commande /CP65001.

source: To retrieve values:
fr: Pour récupérer des valeurs :

source: To run a program such as mspaint.exe, calc.exe, script.ahk or even a folder, you can use the Run command.
fr: Pour lancer un programme comme mspaint.exe, calc.exe, script.ahk ou même un dossier, la commande Run peut être utilisée.

source: To save as UTF-8 with BOM in Notepad, select UTF-8 from the Encoding drop-down in the Save As dialog.
fr: Pour enregistrer en UTF-8 avec BOM dans Notepad, sélectionner UTF-8 dans le menu déroulant Encodage de la boîte de dialogue Enregistrer sous.

source: To set values:
fr: Pour définir des valeurs :

source: To show contents of a variable, use MsgBox or ToolTip.
fr: Pour afficher le contenu d'une variable, utiliser MsgBox ou ToolTip.

source: To silently install AutoHotkey into the default directory (which is the same directory displayed by non-silent mode), pass the parameter /S to the installer.
fr: Pour installer silencieusement AutoHotkey dans le dossier par défaut (qui est le même que celui affiché en mode non silencieux), passer le paramètre /S à l'installateur.

source: To silently uninstall AutoHotkey, pass the /Uninstall parameter to Installer.ahk.
fr: Pour désinstaller silencieusement AutoHotkey, passer le paramètre /Uninstall à Installer.ahk.

source: To stop an action that is repeating inside a Loop, consider the following working example, which is a hotkey that both starts and stops its own repeating action.
fr: Pour arrêter une action qui se répète dans une Loop (boucle), voir l'exemple fonctionnel suivant, avec une hotkey qui démarre et arrête sa propre action répétée.

source: To turn off context sensitivity for subsequent hotkeys or hotstrings, specify any #IfWin directive but leave all of its parameters blank.
fr: Pour désactiver la sensibilité au contexte pour les hotkeys ou hotstrings suivants, spécifier une directive #IfWin quelconque sans spécifier de paramètre.

source: To work around this, use %A_WinDir%\SysNative instead; this is a virtual directory only visible to 32-bit programs running on 64-bit systems.
fr: Pour contourner le problème, utiliser %A_WinDir%\SysNative à la place ; c'est un dossier virtuel seulement visible par les programmes 32-bit exécutés sur des systèmes 64-bit.

source: ToolTip, Press Win-Z again to stop this from flashing.
fr: ToolTip, Appuyer sur Win-Z à nouveau pour empêcher ceci de clignoter.

source: Transform's Unicode sub-command is unavailable on Unicode versions
fr: La sous-commande Unicode de Transform n'est pas disponible sur les versions Unicode

source: Tray Icon
fr: Icône de zone de notification

source: Treats commas as delimiters rather than as literal commas.
fr: Traite les virgules comme des délimiteurs plutôt que des virgules littérales.

source: Treats each backtick character literally rather than as an escape character.
fr: Traite chaque guillemet oblique littéralement plutot que comme caractère d'échappement.

source: Treats percent signs as literal rather than as variable references.
fr: Traite les signes pourcentage littéralement plutôt que comme indiquant des références de variable.

source: Trial and Error
fr: Essayer et Se Tromper

source: Trial and Error is a very common and effective way of learning.
fr: Essayer et se tromper est une manière d'apprendre très courante et très efficace.

source: Try AHKHID.
fr: Essayez AHKHID.

source: Try ControlSend, which might work in cases where the other Send modes fail:
fr: Essayer ControlSend, qui pourrait fonctionner là où d'autres modes de Send échoueraient :

source: Try the down and up event of a key with a Sleep between them:
fr: Essayer les évènements enfoncer et relâcher d'une touche avec un Sleep entre les deux :

source: Try the down and up event of a key with the various send methods:
fr: Essayer les évènements enfoncer et relâcher d'une touche avec les différentes méthodes d'envoi :

source: Try, fail, try, fail, try, try, try, fail, fail, succeed!
fr: Essai, échec, essai, échec, essai, essai, essai, échec, échec, succès !

source: Turn the wheel downward (toward you).
fr: Tournez la roulette vers le bas (vers vous).

source: Turn the wheel upward (away from you).
fr: Tournez la roulette vers le haut (loin de vous).

source: Turns off the omission of spaces and tabs from the end of each line.
fr: Désactive l'omission des espaces et tabulations à la fin de chaque ligne.

source: Tutorial for beginners
fr: Tutoriel pour débutants

source: Typically performs the same function as Browser_Back.
fr: Effectue généralement la même fonction que Browser_Back.

source: Typically performs the same function as Browser_Forward.
fr: Effectue généralement la même fonction que Browser_Forward.

source: Typically the following actions are possible:
fr: Typiquement, les actions suivantes sont possibles :

source: UAC may also prevent SendPlay and BlockInput from working.
fr: Le contrôle du compte d'utilisateur peut aussi empêcher SendPlay et BlockInput de fonctionner.

source: UIA is only effective if the file is in a trusted location; i.e. a Program Files sub-directory.
fr: UIA ne fonctionne que si le fichier est dans un emplacement de confiance, c'est-à-dire un sous-dossier de Program Files.

source: UIA.exe files cannot be modified, as it would invalidate the file's digital signature.
fr: Les fichiers UIA.exe ne peuvent pas être modifiés, puisque cela invaliderait leur signature numérique.

source: UIA.exe files cannot be started via CreateProcess due to security restrictions.
fr: Les fichiers UIA.exe ne peuvent pas être lancés par CreateProcess pour des contraintes de sécurité.

source: UIA.exe files created on one computer cannot run on other computers without first installing the digital certificate which was used to sign them.
fr: Les fichiers UIA.exe créés sur un ordinateur ne peuvent pas être lancés sur un autre sans d'abord installer le certificat numérique utilisé pour les signer.

source: Unicode 64-bit (only valid on 64-bit systems).
fr: Unicode 64-bit (valide uniquement sur les systèmes 64-bit).

source: Unlike unquoted text, it is not necessary to escape commas or percent signs, as quoted strings cannot contain variables.
fr: Au contraire du texte sans guillemets, il n'est pas nécessaire d'échapper les virgules ou symboles pourcentage, puisque les chaînes entre guillemets ne peuvent pas contenir de variable.

source: Unlike Control/Alt/Shift, there is no generic/neutral "Win" key because the OS does not support it.
fr: Contrairement à Ctrl/Alt/Maj, il n’existe pas de touche «Win» générique / neutre car le système d’exploitation ne le supporte pas.

source: Unlike in C/C++, #Include does nothing if the file has already been included by a previous directive.
fr: Au contraire de C/C++, #Include ne fait rien si le fichier a déjà été inclus par une directive précédente.

source: Until then, here's an explanation of the above code:
fr: Jusque-là, voici une explication du code ci-dessus :

source: Usage:
fr: Utilisation :

source: Use ControlSend.
fr: Utiliser ControlSend.

source: Use FormatTime or built-in variables for date and time.
fr: Utiliser FormatTime ou les variables de date/temps intégrées.

source: Use Gui Submit.
fr: Utiliser Gui Submit.

source: Use WinWait, WinWaitClose or WinWait[Not]Active.
fr: Utiliser WinWait, WinWaitClose ou WinWait[Not]Active.

source: Use built-in variables for hotkeys as follows:
fr: Utiliser les variables intégrées pour hotkeys comme suit :

source: Use SendPlay via the SendPlay command, SendMode Play and/or the hotstring option SP.
fr: Utiliser SendPlay via la commande SendPlay, SendMode Play et/ou l'option de hotstring SP.

source: Use the Send command.
fr: Utilisez la commande Send.

source: Use the percent-space prefix at the beginning of a parameter to evaluate that parameter as an expression.
fr: Utiliser le préfixe pourcentage-espace au début d'un paramètre permet d'évaluer ce paramètre comme une expression.

source: Use the script by polyethene (examples are included).
fr: Utiliser le script par polyethene (des exemples sont fournis).

source: Use the tray menu or the ExitApp command to exit a script.
fr: La zone de notification ou la commande ExitApp permettent de mettre fin à l'exécution d'un script.

source: Use the names of the keys (Tab and Space) rather than their characters.
fr: Il faut utiliser le nom des touches (Tab pour tabulation et Space pour la barre espace) plutôt que les caractères.

source: Use what is known as a continuation section.
fr: Il suffit d'utiliser ce qui est connu sous le nom de "continuation section".

source: User-Defined Functions
fr: Fonctions Définies par l'Utilisateur

source: User-defined functions differ from subroutines in that they can accept parameters and return a value, and they can have local variables.
fr: Les fonctions définies par l'utilisateur sont différentes des sous-programmes en leur capacité à accepter des paramètres et renvoyer une valeur, et elles peuvent avoir des variables locales.

source: Users can avoid confusion by always using if (expression).
fr: Pour éviter les confusions, toujours utiliser if (expression).

source: Using Objects
fr: Utiliser les Objets

source: Using non-ASCII characters safely in scripts.
fr: Utiliser sans risque des caractères non-ASCII dans les scripts.

source: Using the Program
fr: Utiliser le programme

source: Using the Program | AutoHotkey
fr: Utiliser le programme | AutoHotkey

source: Usually in such cases the message "7-zip Error" is displayed.
fr: Habituellement dans ces cas-là le message "7-zip Error" est affiché.

source: Usually, an expression takes one or more values as input, performs one or more operations, and produces a value as the result.
fr: Habituellement, une expression prend une valeur ou plus en entrée, réalise une ou plusieurs opérations, et produit une valeur en tant que résultat.

source: Value := Banana.Color
fr: Valeur := Banane.Couleur

source: Value := Banana["Color"]
fr: Valeur := Banane["Couleur"]

source: Value1, Key2:
fr: Valeur1, Clé2:

source: Value2} creates an associative array from a list of key-value pairs.
fr: Valeur2} crée un tableau associatif à partir d'une liste de paires clé-valeur.

source: Var = Text
fr: Var = Texte

source: Var5 += Number
fr: Var5 += Nombre

source: Var5 -= Number
fr: Var5 -= Nombre

source: Var7 = %Var% Text
fr: Var7 = %Var% Texte

source: Var8 := Var " Text"
fr: Var8 := Var " Texte"

source: Variable and Function Names
fr: Noms des variables et des fonctions

source: Variable and function names do not allow [, ] or ?
fr: Les noms de variables et de fonctions n'autorisent pas [, ] ou ?

source: Variable names are always enclosed in percent signs except in cases illustrated in bold below:
fr: Les noms de variables sont toujours entourés de signes pourcentage sauf dans les cas illustrés en gras ci-dessous :

source: Variable names must be enclosed in percent signs only on the right-hand side of the operator.
fr: Les noms de variable doivent être entre signes pourcentage seulement du côté droit de l'opérateur.

source: Variables and expressions
fr: Variables et expressions

source: Variables and their contents - See ListVars.
fr: Variables and their contents (variables et leur contenu) - Voir ListVars.

source: Variables can be assigned a few ways.
fr: L'affectation à des variables peut se faire de différentes manières,

source: Variables cannot be used inside a quoted string.
fr: Les variables ne peuvent pas être utilisées dans une chaîne entre guillemets.

source: Variables do not need to be wrapped in percent signs:
fr: Les variables n'ont pas besoin d'être entourées par des symboles pourcentage :

source: Variables in an expression are never enclosed in percent signs, except to create a double reference.
fr: Dans une expression les variables ne sont jamais entourées de signes pourcentage, sauf pour créer une double référence.

source: View the stack of running subroutines and functions.
fr: Voir la pile des sous-programmes et fonctions en cours d'exécution.

source: Visit Hotkeys and Hotstrings for additional hotkey and hotstring modifiers, information and examples.
fr: Voir Hotkeys et Hotstrings pour plus de modificateurs, informations et exemples sur hotkey et hotstring.

source: We call objects different things depending on what we are using them for, but all objects are the same.
fr: Les objets sont appelés différemment selon leur usage, mais tous les objets sont pareils.

source: We can do that.
fr: Nous pouvons le faire.

source: We did not need curly brackets since there was only one line below it.
fr: Pas besoin d'accolades puisqu'il n'y avait qu'une ligne.

source: We have reached the end of our journey, my good friend.
fr: Le voyage est terminé, cher ami.

source: We love to help, but we also do this for free on our own time.
fr: Nous adorons aider, mais nous le faisons aussi gratuitement sur notre temps libre.

source: We might be at work, sleeping, gaming, with family or just too busy to help.
fr: Nous sommes peut-être au travail, en train de dormir, de jouer, avec de la famille ou juste trop occupés pour aider.

source: We will become great friends.
fr: Nous allons bien nous entendre.

source: We will get more in-depth later on.
fr: Les explications détaillées viendront plus tard.

source: We'll cover the most common forms.
fr: les plus courantes seront traitées.

source: Welcome to AutoHotkey
fr: Bienvenue dans AutoHotkey

source: Welcome...
fr: Bienvenue...

source: Well, good question.
fr: C'est une bonne question.

source: What can I do if AutoHotkey won't install?
fr: Que faire si AutoHotkey ne s'installe pas ?

source: What do I do?
fr: Que faire ?

source: What if you wanted to use ExcludeTitle but not fill in WinText or WinTitle?
fr: Et pour utiliser ExcludeTitle mais sans préciser WinText ou WinTitle ?

source: What is a hotkey?
fr: Qu'est-ce qu'une hotkey ?

source: What is a hotstring?
fr: Qu'est-ce qu'un hotstring?

source: Wheel
fr: Roulette

source: When #IfWin directives are never used in a script, all hotkeys and hotstrings are enabled for all windows.
fr: Quand les directives #IfWin ne sont pas utilisées dans un script, tous les hotkeys et hotstrings sont activés pour toutes les fenêtres.

source: When not to use percent signs:
fr: Quand ne pas utiliser des signes pourcentage :

source: When are quotation marks used with commands and their parameters?
fr: Quand utiliser les guillemets avec les commandes et leurs paramètres ?

source: When commas or percent signs are enclosed in quotes within an expression, the accent is permitted but not necessary.
fr: Quand des virgules ou des signes pourcentage sont entourés de guillemets dans une expression, le backtick peut être mis mais n'est pas nécessaire.

source: When compared to commands, the requirement for parentheses may seem cryptic or verbose at first, but they are what allows a function call to be combined with other operations.
fr: Par rapport aux commandes, la nécessité de mettre des parenthèses peut sembler au premier abord énigmatique ou verbeuse, mais elles sont ce qui permet à un appel de fonction d'être combiné avec d'autres opérations.

source: When evaluated, the object is sent a request "give me the value of property Beta", "store this value in property Beta" or "call the method named Beta".
fr: Lors de l'évaluation, l'objet reçoit une requête "donne moi la valeur de la propriété Beta", "stocke cette valeur dans la propriété Beta" ou "appelle cette méthode nommée Beta".

source: When exactly are variable names enclosed in percent signs?
fr: Quand exactement utiliser les signes pourcentage autour d'un nom de variable ?

source: When it's necessary to prevent the line from being interpreted as a legacy assignment or assignment expression.
fr: Quand elle est nécessaire pour empêcher la ligne d'être interprétée comme affectation dépassée (legacy) ou affectation par expression.

source: When parameters are passed to Ahk2Exe, a message indicating the success or failure of the compiling process is written to stdout.
fr: Quand des paramètres sont donnés à Ahk2Exe, un message indicatif du succès ou de l'échec de la compilation est écrit dans stdout (sortie standard).

source: When should percent signs and commas be escaped?
fr: Quand échapper les signes pourcentage et les virgules ?

source: When the comment option is absent, semicolon and /*..*/ comments are not supported within the interior of a continuation section because they are seen as literal text.
fr: Quand l'option commentaire est absente, les commentaires point-virgule et /*..*/ ne sont pas pris en charge dans la section de continuation puisqu'ils sont vus comme du texte littéral.

source: When the auto-execute section finally completes (if ever), the defaults are updated again to be those that were in effect at the end of the auto-execute section.
fr: Quand la section d'auto-exécution termine enfin (si elle termine), les valeurs par défaut sont mises à jour à nouveau pour être telles qu'à la fin de la section d'auto-exécution.

source: When the command is alone at the top of a continuation section.
fr: Quand la commande est seule en haut d'une section de continuation.

source: When the first parameter is blank.
fr: Quand le premier paramètre est vide.

source: When the script encounters these two lines, it will display the current contents of all variables for your inspection.
fr: Quand le script rencontre ces deux lignes, il affiche le contenu actuel de toutes les variables pour inspection.

source: When the values are arrays too, this is referred to as a nested array, and these will be explained later.
fr: Quand les valeurs sont des tableaux, on parle de tableau imbriqué (nested array), ils seront abordés plus tard.

source: When to use percent signs:
fr: Quand utiliser des signes pourcentage :

source: When to use percents
fr: Quand utiliser les pourcentages

source: When using #Include, it is important to consider what effect the file's contents would have if placed at that position, since #Include will have the same effect.
fr: Lors de l'utilisation de #Include, il est important de considérer l'effet que le contenu du fichier aurait s'il était placé à cet endroit, puisque #Include aura le même effet.

source: When using commands, you cannot squish other commands onto the same line as a previous command (exception:
fr: En utilisant des commandes, il est impossible de mettre plusieurs commandes sur une même ligne (sauf :

source: When writing your code, it is very important to NOT type the square brackets in your code.
fr: Dans l'écriture du code, il est très important de NE PAS écrire ces crochets dans le code.

source: When you are assigning a value to a variable using the legacy mode (an equal sign with no symbol in front of it).
fr: Pendant l'affectation d'une valeur à une variable en mode dépassé (un signe égal sans autre symbole devant).

source: When you are making your code, you might have the urge to put several commands on the same line or inside of each other, don't.
fr: Pendant l'écriture du code, il peut être tentant de mettre plusieurs commandes sur la même ligne ou les unes dans les autres, mais c'est à ne pas faire.

source: When you are using commands (see above), except when the parameter is OutputVar or InputVar.
fr: Pendant l'utilisation d'une commande (voir plus haut), sauf pour les paramètres VarSortie ou VarEntree.

source: When you hear people calling an object an array or indexed array, it usually means that all the keys are sequential numbers 1 and up.
fr: Si un objet est appelé tableau (array) ou tableau indexé (indexed array), cela veut souvent dire que toutes les clés sont des entiers à partir de 1 et plus.

source: When you hear people calling an object an associative array, it means that the keys are either strings (text) or non-sequential numbers.
fr: Si un objet est appelé tableau associatif (associative array), les clés sont soit des chaînes de caractère (du texte) ou des nombres quelconques.

source: When you're ready to resume, un-pause the script via the File or Tray menu.
fr: Une fois prêt à reprendre l'exécution, la pause du script peut être enlevée via le menu fichier ou zone de notification.

source: Where can I find the official build, or older releases?
fr: Où trouver la compilation officielle, ou des versions plus anciennes ?

source: Whether it's 1, or 3253 (or more).
fr: Que ce soit 1, ou 3253 (ou plus).

source: While Beta is a simple name, Param is an ordinary variable or sub-expression, or a list of sub-expressions separated by commas (the same as in a function's parameter list).
fr: Alors que Beta est simplement un nom, Param est une variable ordinaire ou une sous-expression, ou une liste de sous-expressions séparées par des virgules (comme dans la liste de paramètres d'une fonction).
